---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.ViewFailures
source: html/8b5d76df-8a9a-6182-c6ca-4e3f81ad7173.htm
---
# BuiltInFailures.ViewFailures Properties

Plan view DBViewType has invalid view direction parameter.